weifengdq/embedded/tc397/tc397_lwip_iperf/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC39xB/IfxRif_PinMap_TC39xB_LFBGA292_adas.h
/**
 * \file IfxRif_PinMap_TC39xB_LFBGA292_adas.h
 * \brief RIF I/O map
 * \ingroup IfxLld_Rif
 *
 * \version iLLD_1_20_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 *                                 IMPORTANT NOTICE
 *
 * Use of this file is subject to the terms of use agreed between (i) you or
 * the company in which ordinary course of business you are acting and (ii)
 * Infineon Technologies AG or its licensees. If and as long as no such terms
 * of use are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxLld_Rif_pinmap RIF Pin Mapping
 * \ingroup IfxLld_Rif
 */

#ifndef IFXRIF_PINMAP_TC39XB_LFBGA292_ADAS_H
#define IFXRIF_PINMAP_TC39XB_LFBGA292_ADAS_H 1

#include <IfxRif_reg.h>
#include <_Impl/IfxRif_cfg.h>
#include <Port/Std/IfxPort.h>
#include "Ifx_PinMap.h"

/** \addtogroup IfxLld_Rif_pinmap
 * \{ */

/** \brief CLK pin mapping structure */
typedef const struct
{
    Ifx_RIF*          module;   /**< \brief Base address */
    IfxPort_Pin       pin;      /**< \brief Port pin */
    Ifx_RxSel         select;   /**< \brief Input multiplexer value */
} IfxRif_Clk_In;

/** \brief D pin mapping structure */
typedef const struct
{
    Ifx_RIF*          module;   /**< \brief Base address */
    IfxPort_Pin       pin;      /**< \brief Port pin */
    Ifx_RxSel         select;   /**< \brief Input multiplexer value */
} IfxRif_D_In;

/** \brief FR pin mapping structure */
typedef const struct
{
    Ifx_RIF*          module;   /**< \brief Base address */
    IfxPort_Pin       pin;      /**< \brief Port pin */
    Ifx_RxSel         select;   /**< \brief Input multiplexer value */
} IfxRif_Fr_In;

/** \brief ExRamp pin mapping structure */
typedef const struct
{
    Ifx_RIF*          module;   /**< \brief Base address */
    IfxPort_Pin       pin;      /**< \brief Port pin */
    Ifx_RxSel         select;   /**< \brief Input multiplexer value */
} IfxRif_ExRamp_In;


IFX_EXTERN IfxRif_ExRamp_In IfxRif_RAMP1B_P02_6_IN;  /**< \brief External RAMP B input */
IFX_EXTERN IfxRif_ExRamp_In IfxRif_RAMP1B_P10_8_IN;  /**< \brief External RAMP B input */

/** \brief Table dimensions */
#define IFXRIF_PINMAP_NUM_MODULES 2
#define IFXRIF_PINMAP_EXRAMP_IN_NUM_ITEMS 1


/** \brief IfxRif_ExRamp_In table */
IFX_EXTERN const IfxRif_ExRamp_In *IfxRif_ExRamp_In_pinTable[IFXRIF_PINMAP_NUM_MODULES][IFXRIF_PINMAP_EXRAMP_IN_NUM_ITEMS];

/** \} */

#endif /* IFXRIF_PINMAP_TC39XB_LFBGA292_ADAS_H */
